# Groupby()

In [2]:
import pandas as pd
var=pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c"],"S_1":[12,13,14,15,16,17,23,24,18,19,20]
                  ,"S_2":[33,34,23,12,14,45,34,56,35,44,53]})
var

   Name  S_1  S_2
0     a   12   33
1     b   13   34
2     c   14   23
3     d   15   12
4     a   16   14
5     b   17   45
6     a   23   34
7     b   24   56
8     a   18   35
9     c   19   44
10    c   20   53

In [3]:
var_new=var.groupby("Name")
var_new

In [9]:
for x,y in var_new:
    print()
    print(x)
    print(y)

a
  Name  S_1  S_2
0    a   12   33
4    a   16   14
6    a   23   34
8    a   18   35

b
  Name  S_1  S_2
1    b   13   34
5    b   17   45
7    b   24   56

c
   Name  S_1  S_2
2     c   14   23
9     c   19   44
10    c   20   53

d
  Name  S_1  S_2
3    d   15   12

In [10]:
var_new.get_group("a")

  Name  S_1  S_2
0    a   12   33
4    a   16   14
6    a   23   34
8    a   18   35

In [11]:
var_new.min()

      S_1  S_2
Name
a      12   14
b      13   34
c      14   23
d      15   12

In [12]:
var_new.max()

      S_1  S_2
Name
a      23   35
b      24   56
c      20   53
d      15   12

In [13]:
var_new.mean()

            S_1   S_2
Name
a     17.250000  29.0
b     18.000000  45.0
c     17.666667  40.0
d     15.000000  12.0